<a href="https://colab.research.google.com/github/19pa1a0204/AI-Lab/blob/master/Experiment_2_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Experiment2:Pandas

##1.Create a data Frame manually

In [110]:
import pandas as pd
df=pd.DataFrame([["EEE204","A.CHANDU",19],["EEE205","B.RAJESH",20],["EEE207","B.DHATRI",19]],columns=["Roll No","Name","Aga"])
df

  Roll No      Name  Aga
0  EEE204  A.CHANDU   19
1  EEE205  B.RAJESH   20
2  EEE207  B.DHATRI   19

##2.Different ways of importing a dataframe

In [111]:
import pandas as pd
df=pd.read_csv("students_placement_data.csv")
df.head()

   Roll No Gender  ... registered_for_ Placement_Training  placement status
0        1      M  ...                                 NO        Not placed
1        2      F  ...                                yes            Placed
2        3      F  ...                                yes        Not placed
3        4      M  ...                                yes        Not placed
4        5      M  ...                                yes        Not placed

[5 rows x 9 columns]

In [112]:
df.describe()

          Roll No  SSC Percentage  ...  B.Tech_percentage    Backlogs
count  117.000000      116.000000  ...         117.000000  117.000000
mean    59.000000       80.474569  ...          62.943419    4.111111
std     33.919021        8.836079  ...          12.064306    6.335148
min      1.000000       47.800000  ...          31.200000    0.000000
25%     30.000000       76.622500  ...          54.180000    0.000000
50%     59.000000       82.745000  ...          64.360000    0.000000
75%     88.000000       87.025000  ...          72.570000    7.000000
max    117.000000       93.660000  ...          88.100000   25.000000

[8 rows x 5 columns]

In [113]:
df.shape

(117, 9)

##3.Adding, Deleting, Modifying the row/columns in a dataframe.

###3.1)Adding a column

In [114]:
hostler = pd.read_csv("hostlers_day_scholars.csv")
hostler.head()

  hostler/days scholar
0                    d
1                    d
2                    d
3                    d
4                    h

In [115]:
df["hostler/days scholar"] = hostler.values
df.head()

   Roll No Gender  ... placement status  hostler/days scholar
0        1      M  ...       Not placed                     d
1        2      F  ...           Placed                     d
2        3      F  ...       Not placed                     d
3        4      M  ...       Not placed                     d
4        5      M  ...       Not placed                     h

[5 rows x 10 columns]

###3.2) Deleting a column

In [120]:
del df["registered_for_Placement_Training"]
df.head()

   Roll No Gender Section  ...  Rollno  hostler/day's scholar  placement_status
0      1.0      M       A  ...     NaN                    NaN               NaN
1      2.0      F       A  ...     NaN                    NaN               NaN
2      3.0      F       A  ...     NaN                    NaN               NaN
4      5.0      M       A  ...     NaN                    NaN               NaN
5      6.0      M       A  ...     NaN                    NaN               NaN

[5 rows x 13 columns]

###3.3) Adding a row

In [117]:
df1=pd.DataFrame({"Rollno":[110],"Gender":["F"],"Section":["C"],"SSC Percentage":[98.5],"inter_Diploma_percentage":[98],"B.Tech_percentage":[80],"Backlogs":[0],"registered_for_Placement_Training":["Not applicable"],"hostler/day's scholar":["hostlar"],"placement_status":["Not placed"]})
df1

   Rollno Gender  ... hostler/day's scholar  placement_status
0     110      F  ...               hostlar        Not placed

[1 rows x 10 columns]

In [118]:
df = df.append(df1)
df.head()

   Roll No Gender  ... hostler/day's scholar  placement_status
0      1.0      M  ...                   NaN               NaN
1      2.0      F  ...                   NaN               NaN
2      3.0      F  ...                   NaN               NaN
3      4.0      M  ...                   NaN               NaN
4      5.0      M  ...                   NaN               NaN

[5 rows x 14 columns]

##3.4) Deleting a row

In [119]:
df = df.drop(3)
df.head()

   Roll No Gender  ... hostler/day's scholar  placement_status
0      1.0      M  ...                   NaN               NaN
1      2.0      F  ...                   NaN               NaN
2      3.0      F  ...                   NaN               NaN
4      5.0      M  ...                   NaN               NaN
5      6.0      M  ...                   NaN               NaN

[5 rows x 14 columns]

###3.5) Modifying elements

In [121]:
df.loc[1,"hostlers/days scholar"]="hostler"
df.head()

   Roll No Gender  ... placement_status  hostlers/days scholar
0      1.0      M  ...              NaN                    NaN
1      2.0      F  ...              NaN                hostler
2      3.0      F  ...              NaN                    NaN
4      5.0      M  ...              NaN                    NaN
5      6.0      M  ...              NaN                    NaN

[5 rows x 14 columns]

##4.Applying functions on a dataframe.

In [122]:
def gracep(x):
 if(x<70):
  return(x+0.05)
 else:
  return(x)

In [123]:
df["B.Tech_percentage"]=df["B.Tech_percentage"].apply(gracep)
df.head()

   Roll No Gender  ... placement_status  hostlers/days scholar
0      1.0      M  ...              NaN                    NaN
1      2.0      F  ...              NaN                hostler
2      3.0      F  ...              NaN                    NaN
4      5.0      M  ...              NaN                    NaN
5      6.0      M  ...              NaN                    NaN

[5 rows x 14 columns]

##5.Iterations on dataframe.

In [124]:
for index,rows in df[df["B.Tech_percentage"]>=80].iterrows():
   print(rows["Roll No"]),"-",(rows["B.Tech_percentage"])

18.0
60.0
71.0
97.0
102.0
nan

##6.Accessing the elements from a dataframe.

In [125]:
df.loc[[1,2],["SSC Percentage","inter_Diploma_percentage"]]

   SSC Percentage  inter_Diploma_percentage
1            89.0                      92.4
2            67.0                      68.0

##7.Different ways to deal with NA's in dataframe.

In [126]:
import pandas as pd
import numpy as np
df["SSC Percentage"]=df["SSC Percentage"]. replace (to_replace=np.nan,value=np.mean(df["SSC Percentage"]))
df.head()

   Roll No Gender  ... placement_status  hostlers/days scholar
0      1.0      M  ...              NaN                    NaN
1      2.0      F  ...              NaN                hostler
2      3.0      F  ...              NaN                    NaN
4      5.0      M  ...              NaN                    NaN
5      6.0      M  ...              NaN                    NaN

[5 rows x 14 columns]

##8.Groupby operations on dataframe.

In [127]:
group = df.groupby("Gender")
group ["B.Tech_percentage"].agg(np.mean)

Gender
F    71.392400
M    57.343881
Name: B.Tech_percentage, dtype: float64

##9.Merging the dataframes

In [128]:
df2 = pd.read_csv("urban_rural.csv")
df2.head()

   Roll No Urban/Rural
0        1       Urban
1        2       Rural
2        6       Rural
3        7       Urban
4        8       Urban

In [129]:
df = pd.merge(df,df2,on="Roll No")
df.head()

   Roll No Gender Section  ...  placement_status  hostlers/days scholar  Urban/Rural
0      1.0      M       A  ...               NaN                    NaN        Urban
1      2.0      F       A  ...               NaN                hostler        Rural
2      3.0      F       A  ...               NaN                    NaN        Urban
3      5.0      M       A  ...               NaN                    NaN        Urban
4      6.0      M       A  ...               NaN                    NaN        Rural

[5 rows x 15 columns]